tutorials/thermoFluidSolidInteraction/hotTJunction/constant/solid/polyMesh/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| solids4foam: solid mechanics and fluid-solid interaction simulations        |
| Version:     v2.3                                                           |
| Web:         https://solids4foam.github.io                                  |
| Disclaimer:  This offering is not approved or endorsed by OpenCFD Limited,  |
|              producer and distributor of the OpenFOAM software via          |
|              www.openfoam.com, and owner of the OPENFOAM® and OpenCFD®      |
|              trade marks.                                                   |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant/polyMesh";
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale 0.001;

vertices
(
    // bottom block
    (0 -0.5 0)
    (6 -0.5 0)
    (6 0 0)
    (0 0 0)
    (0 -0.5 1)
    (6 -0.5 1)
    (6 0 1)
    (0 0 1)

    // top left block
    (0 2 0)
    (1.5 2 0)
    (2 2 0)
    (0 2.5 0)
    (1.5 2.5 0)
    (2 2.5 0)
    (1.5 4 0)
    (2 4 0)
    (0 2 1)
    (1.5 2 1)
    (2 2 1)
    (0 2.5 1)
    (1.5 2.5 1)
    (2 2.5 1)
    (1.5 4 1)
    (2 4 1)

    // top right block
    (3 2 0)
    (3.5 2 0)
    (6 2 0)
    (3 2.5 0)
    (3.5 2.5 0)
    (6 2.5 0)
    (3 4 0)
    (3.5 4 0)
    (3 2 1)
    (3.5 2 1)
    (6 2 1)
    (3 2.5 1)
    (3.5 2.5 1)
    (6 2.5 1)
    (3 4 1)
    (3.5 4 1)
);

blocks
(
    // bottom
    hex (0 1 2 3 4 5 6 7) (60 5 1) simpleGrading (1 1 1)

    // top left
    hex (8 9 12 11 16 17 20 19) (15 5 1) simpleGrading (1 1 1)
    hex (9 10 13 12 17 18 21 20) (5 5 1) simpleGrading (1 1 1)
    hex (12 13 15 14 20 21 23 22) (5 15 1) simpleGrading (1 1 1)

    // top right
    hex (24 25 28 27 32 33 36 35) (5 5 1) simpleGrading (1 1 1)
    hex (25 26 29 28 33 34 37 36) (25 5 1) simpleGrading (1 1 1)
    hex (27 28 31 30 35 36 39 38) (5 15 1) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    fixed
    {
        type patch;
        faces
        (
            // bottom block
            (0 4 7 3)
            (1 2 6 5)

            // top left block
            (8 16 19 11)
            (15 14 22 23)

            // top right block
            (26 29 37 34)
            (31 30 38 39)
        );
    }

    interface
    {
        type patch;
        faces
        (
            // bottom block
            (2 3 7 6)

            // top left block
            (8 9 17 16)
            (9 10 18 17)
            (10 13 21 18)
            (13 15 23 21)

            // top right block
            (30 27 35 38)
            (27 24 32 35)
            (24 25 33 32)
            (25 26 34 33)
        );
    }

    free
    {
        type patch;
        faces
        (
            // bottom block
            (0 1 5 4)

            // top left block
            (12 11 19 20)
            (14 12 20 22)

            // top right block
            (28 31 39 36)
            (29 28 36 37)
        );
    }

    frontAndBack
    {
        type empty;
        faces
        (
            // bottom block
            (0 3 2 1)
            (4 5 6 7)

            // top left block
            (8 11 12 9)
            (9 12 13 10)
            (12 14 15 13)
            (19 16 17 20)
            (20 17 18 21)
            (22 20 21 23)

            // top right block
            (30 31 28 27)
            (27 28 25 24)
            (28 29 26 25)
            (35 36 39 38)
            (32 33 36 35)
            (33 34 37 36)
        );
    }
);

// ************************************************************************* //
