tutorials/thermoFluidSolidInteraction/hotTJunction/constant/fluid/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
| solids4foam: solid mechanics and fluid-solid interaction simulations        |
| Version:     v2.3                                                           |
| Web:         https://solids4foam.github.io                                  |
| Disclaimer:  This offering is not approved or endorsed by OpenCFD Limited,  |
|              producer and distributor of the OpenFOAM software via          |
|              www.openfoam.com, and owner of the OPENFOAM® and OpenCFD®      |
|              trade marks.                                                   |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

nu              nu [0 2 -1 0 0 0 0] 2.1e-5;
rho             rho [1 -3 0 0 0 0 0] 1;

// For piso/transientSimple
transportModel  Newtonian;

// Thermal properties
TRef            TRef [0 0 0 1 0 0 0] 303.0;

Cp              Cp [0 2 -2 -1 0 0 0] 1010;

beta            beta [0 0 0 -1 0 0 0] 2.85e-3;

Prt             Prt [0 0 0 0 0 0 0] 0.85;

// Pr              Pr [0 0 0 0 0 0 0] 0.71;
lambda          lambda [1 1 -3 -1 0 0 0] 0.03;

// ************************************************************************* //
