tutorials/thermoFluidSolidInteraction/hotTJunction/constant/fsiProperties
/*--------------------------------*- C++ -*----------------------------------*\
| solids4foam: solid mechanics and fluid-solid interaction simulations        |
| Version:     v2.3                                                           |
| Web:         https://solids4foam.github.io                                  |
| Disclaimer:  This offering is not approved or endorsed by OpenCFD Limited,  |
|              producer and distributor of the OpenFOAM software via          |
|              www.openfoam.com, and owner of the OPENFOAM® and OpenCFD®      |
|              trade marks.                                                   |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fsiProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

fluidSolidInterface thermal;

"thermalCoeffs|fixedRelaxationCoeffs"
{
    // Interface patches
    solidPatch interface;
    fluidPatch interface;

    // Predict interface temperature and heat flux fields at the start of a new
    // time step using linearly extrapolation
    predictTemperatureAndHeatFlux yes;

    // Enable FSI coupling
    mechanicalCoupling yes;

    // Fixed under-relaxation factor for thermal FSI coupling
    // relaxationFactor is used if thermoRelaxationFactor is not given
    thermoRelaxationFactor 1.0;

    // Fixed under-relaxation factor for mechanical FSI coupling
    relaxationFactor 1.0;

    // Thermo-FSI outer loop tolerance
    outerCorrTolerance 1e-5;

    // Thermo-FSI outer maximum number of iterations
    nOuterCorr 100;

    // Enable thermo-FSI coupling
    coupled yes;

    // Write residuals to a file
    writeResidualsToFile yes;
}

// ************************************************************************* //
