tutorials/thermoFluidSolidInteraction/hotTJunction/constant/solid/solidProperties
/*--------------------------------*- C++ -*----------------------------------*\
| solids4foam: solid mechanics and fluid-solid interaction simulations        |
| Version:     v2.3                                                           |
| Web:         https://solids4foam.github.io                                  |
| Disclaimer:  This offering is not approved or endorsed by OpenCFD Limited,  |
|              producer and distributor of the OpenFOAM software via          |
|              www.openfoam.com, and owner of the OPENFOAM® and OpenCFD®      |
|              trade marks.                                                   |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      solidProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// thermalSolid only solves the heat equation, whereas thermalLinearGeometry
// solves the heat equation coupled with the momentum equation
//solidModel thermalSolid;
solidModel thermalLinearGeometry;

"thermalSolidCoeffs|thermalLinearGeometryCoeffs"
{
    // Maximum number of correctors
    nCorrectors             10000;

    // Solution tolerance
    solutionTolerance       1e-06;

    // Alternative solution tolerance
    alternativeTolerance    1e-07;

    // Write frequency for the residuals
    infoFrequency           100;
}

// ************************************************************************* //
