tutorials/thermoFluidSolidInteraction/hotTJunction/0/fluid/U
/*--------------------------------*- C++ -*----------------------------------*\
| solids4foam: solid mechanics and fluid-solid interaction simulations        |
| Version:     v2.3                                                           |
| Web:         https://solids4foam.github.io                                  |
| Disclaimer:  This offering is not approved or endorsed by OpenCFD Limited,  |
|              producer and distributor of the OpenFOAM software via          |
|              www.openfoam.com, and owner of the OPENFOAM® and OpenCFD®      |
|              trade marks.                                                   |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    inlet1
    {
        type            fixedValue;
        value           uniform (0.1 0 0);
    }

    inlet2
    {
        // OpenFOAM
//        type            scaledFixedValue;

        // Time vs scale factor
        scale table
        (
            (0.0 0.0)
            (0.1 1.0)
            (0.2 0.0)
        );

        // The true velocity is the reference value times the scale factor
        refValue
        {
            type            fixedValue;
            value           uniform (0 -1 0);
        }

        // foam extend
        type            timeVaryingUniformFixedValue;
        "file|fileName"   "$FOAM_CASE/constant/fluid/timeVsVelocity.fe41";
        outOfBounds       clamp;
    }

    interface
    {
        type            newMovingWallVelocity;
        value           uniform (0 0 0);
    }

    outlet
    {
        type            zeroGradient;
    }

    frontAndBack
    {
        type            empty;
    }
}

// ************************************************************************* //
